Revit 2027 API
ExternalDataManagerDataItem.SetId Method
 Sets the id of the data item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetId(
	ExternalDataManagerDataItemId id
)
Public Sub SetId (
	id As ExternalDataManagerDataItemId
)
public:
void SetId(
	ExternalDataManagerDataItemId^ id
)
member SetId :
        id : ExternalDataManagerDataItemId -> unit
Parameters
id ExternalDataManagerDataItemId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace